# Pandas reading and Writing

The main purpose of this noyebook to get you to look at the pandas documentation [Pandas Doc](https://pandas.pydata.org/pandas-docs/stable/index.html)

## Import the pandas
and set the sample data directory and filename

In [128]:
import pandas as pd

In [129]:
# just check the directory and file are there
!dir "../data"

 Volume in drive C is Windows
 Volume Serial Number is DCD0-CBD8

 Directory of c:\Users\laura\Documents\GitHub\PDFA\My-Work\data

30/10/2025  11:49    <DIR>          .
23/10/2025  14:55    <DIR>          ..
29/10/2025  11:03            19,904 bankholidays.json
29/10/2025  11:20                54 data.csv
29/10/2025  10:59            25,853 iris.json
23/10/2025  14:59                60 numbers.txt
30/10/2025  11:49            11,349 people-100-no-header.csv
30/10/2025  11:28            11,425 people-100.csv
29/10/2025  10:46             2,806 projectedbirths-cso.csv
29/10/2025  10:06                61 students.csv
               8 File(s)         71,512 bytes
               2 Dir(s)  367,215,718,400 bytes free

In [130]:
# up one levels to topic03 and then down into data
datadir = "../data/"
filename="people-100.csv"

## Read in the csv file

df = pd.read_csv(file)

In [131]:
df=pd.read_csv(datadir+filename)

check what you got using df.head() df.info()

In [132]:
df.head()

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon

In [133]:
df.info

<bound method DataFrame.info of     Index          User Id First Name  Last Name     Sex  \
0       1  88F7B33d2bcf9f5     Shelby    Terrell    Male
1       2  f90cD3E76f1A9b9    Phillip    Summers  Female
2       3  DbeAb8CcdfeFC2c   Kristine     Travis    Male
3       4  A31Bee3c201ef58    Yesenia   Martinez    Male
4       5  1bA7A3dc874da3c       Lori       Todd    Male
..    ...              ...        ...        ...     ...
95     96  5eFda7caAeB260E     Dennis     Barnes  Female
96     97  CCbFce93d3720bE      Steve  Patterson  Female
97     98  2fEc528aFAF0b69     Wesley       Bray    Male
98     99  Adc7ad9B6e4A1Fe     Summer   Oconnell  Female
99    100  b8D0aD3490FC7e1     Mariah    Bernard    Male

                         Email                   Phone Date of birth  \
0         elijah57@example.net  001-084-906-7849x73518    1945-10-26
1        bethany14@example.com       214.112.6044x4913    1910-03-24
2        bthompson@example.com            277.609.7938    1992-07-02
3    kaitlinkaiser@example.com            584.094.6111    2017-08-03
4   buchananmanuel@example.net       689-207-3558x7233    1938-12-01
..                         ...                     ...           ...
95         bmartin@example.org    001-095-524-2112x257    1954-07-30
96       latasha46@example.net        001-865-478-5157    1932-04-29
97        regina11@example.org      995-542-3004x76800    1994-12-28
98  alexiscantrell@example.org    001-273-685-6932x092    2012-04-12
99       pcopeland@example.org     (341)594-6554x44657    2016-11-15

                Job Title
0         Games developer
1          Phytotherapist
2               Homeopath
3       Market researcher
4      Veterinary surgeon
..                    ...
95      Software engineer
96              Barrister
97         Police officer
98   Broadcast journalist
99  IT sales professional

[100 rows x 9 columns]>

## Reading in dates
mmmm! I would like the Date of birth to be a date object
use pd.read_csv(file, parse_dates=[colnum])

In [134]:
df = pd.read_csv(datadir+filename, parse_dates=['Date of birth'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          100 non-null    int64
 1   User Id        100 non-null    object
 2   First Name     100 non-null    object
 3   Last Name      100 non-null    object
 4   Sex            100 non-null    object
 5   Email          100 non-null    object
 6   Phone          100 non-null    object
 7   Date of birth  100 non-null    datetime64[ns]
 8   Job Title      100 non-null    object
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 7.2+ KB

## While I am here 

if you want to limit what columes are read in header=[list of cols]

In [135]:
names_of_columns=['First Name', 'Last Name','Email','Phone', 'Date of birth']
df=pd.read_csv(datadir+filename, usecols=names_of_columns,)
df.head(3)

,First Name,Last Name,Email,Phone,Date of birth
0,Shelby,Terrell,elijah57@example.net,001-084-906-7849x73518,1945-10-26
1,Phillip,Summers,bethany14@example.com,214.112.6044x4913,1910-03-24
2,Kristine,Travis,bthompson@example.com,277.609.7938,1992-07-02

## If there is not a header row and you want to make names

use header names use index_col to specifify the index Column

In [136]:
filename=filename="people-100-no-header.csv"

In [137]:
df= pd.read_csv(datadir+filename)
df.head(3)

,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
0,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
1,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
2,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher

In [138]:
df= pd.read_csv(datadir+filename, header=None, index_col=0)
df.head(3)

,1,2,3,4,5,6,7,8
0,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath

In [139]:
names=['index','id','firstname','lastname','sex','email','phone','DOB','occupation']
df= pd.read_csv(datadir+filename, header=None,index_col=0,names=names, parse_dates=['DOB'])
df.head(3)
#df.info()

,id,firstname,lastname,sex,email,phone,DOB,occupation
index,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath

In [140]:
names=['index','id','firstname','lastname','sex','email','phone','DOB','occupation']
df= pd.read_csv(datadir+filename, header=None,index_col=0,names=names, parse_dates=['DOB'])
df.head(3)
#df.info()

,id,firstname,lastname,sex,email,phone,DOB,occupation
index,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath

## Reading from https or even S3 buckets

you can read files directly from the cloud into a Data Frame

In [141]:
df = pd.read_csv("https://drive.google.com/uc?id=1zO8ekHWx9U7mrbx_0Hoxxu6od7uxJqWw&export=download")
df.head(3)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/

Or even an S3 bucket I had to pip install s3fs on my machine for this to work

In [142]:
# It can take a while to find a file you want
# this file contains weather info for phoenix in 2020
remote_file = "s3://noaa-gsod-pds/2020/72278023183.csv"

df = pd.read_csv( remote_file, storage_options={"anon": True})
df.head(3)

,STATION,DATE,LATITUDE,LONGITUDE,ELEVATION,NAME,TEMP,TEMP_ATTRIBUTES,DEWP,DEWP_ATTRIBUTES,...,MXSPD,GUST,MAX,MAX_ATTRIBUTES,MIN,MIN_ATTRIBUTES,PRCP,PRCP_ATTRIBUTES,SNDP,FRSHTT
0,72278023183,2020-01-01,33.4278,-112.00365,339.2,"PHOENIX AIRPORT, AZ US",50.4,24,32.8,24,...,11.1,999.9,60.1,,39.9,,0.0,G,999.9,0
1,72278023183,2020-01-02,33.4278,-112.00365,339.2,"PHOENIX AIRPORT, AZ US",51.0,24,36.4,24,...,9.9,999.9,64.0,,39.9,,0.0,G,999.9,0
2,72278023183,2020-01-03,33.4278,-112.00365,339.2,"PHOENIX AIRPORT, AZ US",52.0,24,31.9,24,...,8.0,999.9,64.0,,41.0,,0.0,G,999.9,0

## Writing data

if i do not know a data set I like to write it out to an Excel file so that I can inspect it

In [143]:
workbookFileName = 's3Data.xlsx'
df.to_excel(workbookFileName, sheet_name='phoenix', index=False)

More information on the PANDAS documenation https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-excel-writer